projectFiles/bentPipe/Re20000/q-500/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.0001;

boundaryField
{
    heatWall
    {
     	type            epsilonWallFunction;
     	value           uniform 0;   
    }
    wall
    {
     	type            epsilonWallFunction;
     	value           uniform 0;   
    }
    outlet
    {
	type            inletOutlet;
        inletValue      uniform 0.0001;
    }

    inlet
    {
       type            turbulentMixingLengthDissipationRateInlet;
       mixingLength    0.071;       
       value           uniform 0.0001;
    }
}


// ************************************************************************* //
